---
kind: method
id: M:Autodesk.Revit.DB.SchedulableField.op_Inequality(Autodesk.Revit.DB.SchedulableField,Autodesk.Revit.DB.SchedulableField)
source: html/531d79a1-8b08-df44-2e2a-7471b823959c.htm
---
# Autodesk.Revit.DB.SchedulableField.op_Inequality Method

Determines whether two SchedulableField are different.

## Syntax (C#)
```csharp
public static bool operator !=(
	SchedulableField first,
	SchedulableField second
)
```

## Parameters
- **first** (`Autodesk.Revit.DB.SchedulableField`) - The first SchedulableField.
- **second** (`Autodesk.Revit.DB.SchedulableField`) - The second SchedulableField.

## Returns
True if the SchedulableField are different, otherwise false.